org/_posts/2018-01-12-five-tribes-of-ml.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: "Five tribes of Machine Learning"
date: 2018-01-12
comments: true
archive: true
notes: true
tags: notes
excerpt: Five tribes of machine learning.
---
#+END_HTML

*Five tribes of machine learning*

| Tribe          |   | Origins              |   | Master Algorithm        |
|----------------+---+----------------------+---+-------------------------|
| Symbolists     |   | Logic, philosophy    |   | Inverse deduction       |
| Connectionists |   | Neuroscience         |   | Backpropagation         |
| Evolutionaries |   | Evolutionary biology |   | Genetic programming     |
| Bayesians      |   | Statistics           |   | Probabilistic inference |
| Annalogizers   |   | Psychology           |   | Kernel machines         |


*How do computers discover new knowledge?*

1. Fill in graps in existing knowledge
2. Emulate the brain
3. Simulate evolution
4. Systematically reduce uncertainty
5. Notice similarities between old and new

[[https://learning.acm.org/webinar_pdfs/PedroDomingos_FTFML_WebinarSlides.pdf][Slides]]
