_posts/2018-01-12-five-tribes-of-ml.html
layout: post
title: "Five tribes of Machine Learning"
date: 2018-01-12
comments: true
archive: true
notes: true
tags: notes
excerpt: Five tribes of machine learning.

<p>
<b>Five tribes of machine learning</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tribe</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Origins</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Master Algorithm</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Symbolists</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Logic, philosophy</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Inverse deduction</td>
</tr>

<tr>
<td class="org-left">Connectionists</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Neuroscience</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Backpropagation</td>
</tr>

<tr>
<td class="org-left">Evolutionaries</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Evolutionary biology</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Genetic programming</td>
</tr>

<tr>
<td class="org-left">Bayesians</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Statistics</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Probabilistic inference</td>
</tr>

<tr>
<td class="org-left">Annalogizers</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Psychology</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Kernel machines</td>
</tr>
</tbody>
</table>


<p>
<b>How do computers discover new knowledge?</b>
</p>

<ol class="org-ol">
<li>Fill in graps in existing knowledge</li>
<li>Emulate the brain</li>
<li>Simulate evolution</li>
<li>Systematically reduce uncertainty</li>
<li>Notice similarities between old and new</li>
</ol>

<p>
<a href="https://learning.acm.org/webinar_pdfs/PedroDomingos_FTFML_WebinarSlides.pdf">Slides</a>
</p>
